# Задача 2
# Найдите сумму цифр трехзначного числа.
# Пример:
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)


n = int(input('Введите трехзначное число: '))
if n > 99 and n < 1000:
    s1 = n // 100
    s2 = n % 100 // 10
    s3 = n % 10
    sum = s1 + s2 + s3
    print(s1, '+', s2, '+', s3, '=', sum)
else:
    print('Введено неверное число')